Revit 2027 API
Subelement.GetAllParameters Method
 Returns all parameters of this subelement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetAllParameters()
Public Function GetAllParameters As IList(Of ElementId)
public:
IList<ElementId^>^ GetAllParameters()
member GetAllParameters : unit -> IList<ElementId>
Return Value
IList<ElementId>
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace